Public Attributes | List of all members
API_GridType Struct Reference
Project Settings
The grid parameters. More...
#include <APIdefs_Database.h>
 Public Attributes
double  | spaceMainX
The main grid's horizontal spacing in meters.
double  | spaceMainY
The main grid's vertical spacing in meters.
short  | nLineMainX
The number of horizontal lines in the main grid.
short  | nLineMainY
The number of vertical lines in the main grid.
bool  | gridSwitch
true if grid is visible
double  | spaceAuxX
The horizontal spacing of the auxiliary grid in meters.
double  | spaceAuxY
The vertical spacing of the auxiliary grid in meters.
short  | nLineAuxX
The number of horizontal auxiliary grid lines.
short  | nLineAuxY
The number of vertical auxiliary grid lines.
unsigned char  | gridMode
Gravity to the grid; 0 : none, 1 : grid, 2 : snap.
double  | snapOffsX
The snap grid's horizontal offset in meters.
double  | snapOffsY
The snap grid's vertical offset in meters.
double  | snapStepX
The snap grid's horizontal spacing in meters.
double  | snapStepY
The snap grid's vertical offset in meters.
short  | status
status of the grid
double  | gridAngle
rotation angle of the grid, relative to horizontal
double  | gridOffsX
X offset of the grid.
double  | gridOffsY
Y offset of the grid.
double  | gridOffsZ
Z offset of the grid.
API_RGBAColor  | backColor
background color. Transparency is effective only in the Model window.
API_RGBAColor  | gridColor
color of main grid lines. Transparency is effective only in the Model window.
Detailed Description
The grid parameters.
Remarks
Each database window may have different grid setting parameters. To get the actual settings associated to a database use the ACAPI_Window_GetGridSettings function; to change the parameters refer to the ACAPI_Window_ChangeGridSettings function.
Member Data Documentation
◆ backColor
 API_GridType::backColor
background color. Transparency is effective only in the Model window.
◆ gridAngle
 API_GridType::gridAngle
rotation angle of the grid, relative to horizontal
◆ gridColor
 API_GridType::gridColor
color of main grid lines. Transparency is effective only in the Model window.
◆ gridMode
 API_GridType::gridMode
Gravity to the grid; 0 : none, 1 : grid, 2 : snap.
◆ gridOffsX
 API_GridType::gridOffsX
X offset of the grid.
◆ gridOffsY
 API_GridType::gridOffsY
Y offset of the grid.
◆ gridOffsZ
 API_GridType::gridOffsZ
Z offset of the grid.
◆ gridSwitch
 API_GridType::gridSwitch
true if grid is visible
◆ nLineAuxX
 API_GridType::nLineAuxX
The number of horizontal auxiliary grid lines.
◆ nLineAuxY
 API_GridType::nLineAuxY
The number of vertical auxiliary grid lines.
◆ nLineMainX
 API_GridType::nLineMainX
The number of horizontal lines in the main grid.
◆ nLineMainY
 API_GridType::nLineMainY
The number of vertical lines in the main grid.
◆ snapOffsX
 API_GridType::snapOffsX
The snap grid's horizontal offset in meters.
◆ snapOffsY
 API_GridType::snapOffsY
The snap grid's vertical offset in meters.
◆ snapStepX
 API_GridType::snapStepX
The snap grid's horizontal spacing in meters.
◆ snapStepY
 API_GridType::snapStepY
The snap grid's vertical offset in meters.
◆ spaceAuxX
 API_GridType::spaceAuxX
The horizontal spacing of the auxiliary grid in meters.
◆ spaceAuxY
 API_GridType::spaceAuxY
The vertical spacing of the auxiliary grid in meters.
◆ spaceMainX
 API_GridType::spaceMainX
The main grid's horizontal spacing in meters.
◆ spaceMainY
 API_GridType::spaceMainY
The main grid's vertical spacing in meters.
◆ status
 API_GridType::status
status of the grid